<!-- dflook/terraform-github-actions {"workspace":"verify","backend":"07e578a84baefd85251a6f5f8c6cdba06dcd9dddad586a7fedecb62b2964b811","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #255 at https://github.com/dflook/terraform-github-actions/actions/runs/3253215683","plan_hash":"cfecd77d6bbc0f9e00ef036f98f961c811a2cdfd41d52ce9dc5b339d5151219c","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __verify__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "Hfq9YbNdyz" -> (known after apply)
  ~ foreach = "hawqU17r60" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #255](https://github.com/dflook/terraform-github-actions/actions/runs/3253215683)